hotheater1/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
fluidheatsource
{
    type            scalarSemiImplicitSource;
    active          true;
        
    scalarSemiImplicitSource
    {
        selectionMode 	cellZone;
	cellZone	fluid;
        volumeMode      specific;
        injectionRateSuSp
        {
            T              (310 0);
        }
    }
}
 
 
// ************************************************************************* //
