hotheater1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4900;
        startFace       1066845;
    }
    minX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4900;
        startFace       1071745;
    }
    maxX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4900;
        startFace       1076645;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4900;
        startFace       1081545;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4900;
        startFace       1086445;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4900;
        startFace       1091345;
    }
)

// ************************************************************************* //
